"use client";

import { Form, FormInstance, Radio, Typography } from "antd";

const { Text } = Typography;

export const LandingElement = (props: { form: FormInstance<any> }) => {
  const { form } = props;
  return (
    <div style={{ display: "flex", flexDirection: "column" }}>
      <Text style={{ fontSize: 24 }}>คำถามคัดกรองเบื้องต้น </Text>
      <Text>
        ให้ท่านตรวจสอบว่าคดีของท่าน 1.เป็นคดีดูหมิ่นหรือหมิ่นประมาทหรือไม่
        2.เป็นคดีการโอนเงินผิดบัญชีหรือไม่
        3.เป็นคดีที่มีการกระทำผิดบนออนไลน์แต่ไม่มีทรัพย์ถูกประทุษร้ายในคดีหรือไม่
        เช่นท่านโดนแฮกเฟสบุ้ค แล้วถูกนำไปขอยืนเงินผู้อื่น
        แต่ตัวท่านไม่ได้โอนเงินให้คนร้าย เป็นต้น
        4.เป็นคดีที่ทรัพย์ถูกประทุษร้ายเป็นทรัพย์สินบนออนไลน์ที่ไม่ใช่เงิน เช่น
        ไอเทมในเกม ,ไอดีเกม ,คริปโตเคอเรนซี หากเป็นคดีในข้อ 1 และ 2
        กระผมจะไม่ได้เป็นผู้รับผิดชอบ
        ขอให้ท่านติดต่อพนักงานสอบสวนที่เข้าเวรอยู่ในขณะนั้นแทน หากเป็นคดีในข้อ 3
        และ 4 จะไม่ได้มีการออกหนังสืออายัดบัญชีให้
        แต่จะดำเนินการสอบสวนเพื่อหาตัวผู้กระทำความผิดมาดำเนินคดีต่อไป
        เมื่อท่านตรวจสอบแล้วพบว่าคดีของท่านไม่เข้าเงื่อนไขทั้ง 4 ข้อ
        ให้ถือว่าเป็นคดีทางออนไลน์และจะดำเนินการออกหนังสืออายัดบัญชีต่อไป
      </Text>
      <Form layout="vertical" form={form}>
        <Form.Item
          label="ตอบคำถามสำหรับคัดกรองเบื้องต้น"
          rules={[
            {
              required: true,
              message: "กรุณากรอกข้อมูล",
            },
          ]}
          name="type"
        >
          <Radio.Group>
            <Radio value={"DEFAME"}>เป็นคดีหมิ่นประมาท</Radio>
            <Radio value={"TWRONG_TRANS"}>เป็นคดีการโอนเงินผิดบัญชี</Radio>
            <Radio value={"NO_HARM"}>เป็นคดีที่ไม่มีทรัพย์ถูกประทุษร้าย</Radio>
            <Radio value={"HARMED_ASSET"}>
              เป็นคดีที่ทรัพย์ถูกประทุษร้ายเป็นทรัพย์สินบนออนไลน์
            </Radio>
            <Radio value={"OTHERS"}>
              ไม่เข้าเงื่อนไขทั้งสี่ ให้ดำเนินการขั้นตอนต่อไป
              (โอนเงินบนแอพธนาคารกดข้อนี้)
            </Radio>
          </Radio.Group>
        </Form.Item>
      </Form>
    </div>
  );
};
